app/controllers/keys_controller.rb

  def index
    @keys = Key.all
---
SELECT "keys".* FROM "keys"

  def show
    @key = Key.find(params[:id])
---
SELECT "keys".* FROM "keys" WHERE "keys"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    #must change to production
    #name = params[:name]
    name = params[:key]["name"]
    if name.eql? "position"
      @position = Key.find_by_name("position")
      if @position
        #must change as well to production
        #@position.value = params[:value]
        @position.value = params[:key]["value"]
        @position.save
        redirect_to @position, notice: 'position was successfully updated.'
        return
      end
    end

    if(params[:key])
      @key = Key.new(params[:key])
    else
      @key = Key.new
      @key.name = params[:name]
      @key.value = params[:value]
    end

    respond_to do |format|
      if @key.save
---
SELECT "keys".* FROM "keys" WHERE "keys"."name" = 'position' LIMIT 1
UPDATE "keys" SET "value" = NULL, "updated_at" = '2012-04-13 23:52:24.237063' WHERE "keys"."id" = 1
INSERT INTO "keys" ("created_at", "name", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", Fri, 13 Apr 2012 23:25:51 UTC +00:00], ["name", "position"], ["updated_at", Fri, 13 Apr 2012 23:25:51 UTC +00:00], ["value", "12.456789878; -78.1254878"]]

  def destroy
    @key = Key.find(params[:id])
    @key.destroy
---
SELECT "keys".* FROM "keys" WHERE "keys"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "keys" WHERE "keys"."id" = ?  [["id", 2]]