app/controllers/keys_controller.rb

SELECT "keys".* FROM "keys" WHERE "keys"."name" = 'coordinates'
---
  def index
    @keys = Key.where(:name => "coordinates")