app/controllers/map_controller.rb

  def show_position
    @position = Key.find_by_name("position")
---
SELECT "keys".* FROM "keys" WHERE "keys"."name" = 'position' LIMIT 1