app/controllers/push_message_controller.rb

  def send_message
    @message = params[:message]
    @reg_id = Key.find_by_name("registration_id").value
---
SELECT "keys".* FROM "keys" WHERE "keys"."name" = 'registration_id' LIMIT 1